#+TITLE: Clase 20 - C
* Hola Mundo
#+begin_src C
#include <stdio.h>

int main() {
  printf("Hello World!\n");
  return 0;
}
#+end_src

#+RESULTS:
: Hello World!
** EJ 17.1
#+begin_src C
#include <stdio.h> // Para poder imprimir

void imprimir_area_rectangulo(int base, int altura) {
  int resultado = base * altura;
  printf("%d\n", resultado);
}

int main() {
  imprimir_area_rectangulo(3, 2);
  return 0;
}
#+end_src

#+RESULTS:
: 6
** Ej 17.2
#+begin_src C
#include <stdio.h>

int factorial(int n) {
  int resultado = 1;
  for (int i = 1; i <= n; i++) {
    resultado *= i;
  }
  return resultado;
}

int main() {
  int resultado = factorial(5);
  printf("%d\n", resultado);
  return 0;
}
#+end_src

#+RESULTS:
: 120
*** Version recursiva
#+begin_src C
#include <stdio.h>

int factorial(int n) {
  if (n <= 1) {
    return 1;
  }
  return n * factorial(n - 1);
}

int main() {
  int resultado = factorial(5);
  printf("%d\n", resultado);
  return 0;
}
#+end_src

#+RESULTS:
: 120
** Ej 17.3
#+begin_src C
#include <stdio.h>

int calcular_promedio(int numeros[], int cantidad) {
  int suma = 0;
  for (int i = 0; i < cantidad; i++) {
    suma += numeros[i];
  }
  return suma / cantidad;
}

int main() {
  int numeros[] = {7, 8, 4, 10, 3};
  int resultado = calcular_promedio(numeros, 5);
  printf("%d\n", resultado);
  return 0;
}
#+end_src

#+RESULTS:
: 6
